#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_b-ce-id-prod-3730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1160aca7-8a9a-4781-849c-540b076355a0]
module.keycloak_dev.module.onestopauth_basic.module.client_b-ce-id-prod-3730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6b6210d3-285a-41ee-9127-fe1dfa07393a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=934a6132-335a-4abb-b21b-8ba8e7a171e7]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=291fedbf-ec46-45de-8332-11835e708442]
module.keycloak_dev.module.onestopauth_basic.module.client_b-ce-id-prod-3730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=eb483756-5924-4756-8e55-79e98a7e73fb]
module.keycloak_dev.module.onestopauth_basic.module.client_b-ce-id-prod-3730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e1d168d4-4424-43df-9126-f9309f9df231]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=eecc57dd-b85f-44c1-832e-5391b4fb8c5c]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2cac6a93-6012-49f2-ae8e-40b8fc62978a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e5949b15-432f-4a8f-bf6d-2d46c1369413]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c4dfcedb-db24-487f-8a5d-8518174e4740]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3a4ac4e7-da90-4042-aef9-10677d990afb]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e5d4599c-95e0-40ec-8a42-61ec36d3a7ea]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=65874df5-8751-49f2-abc2-e261d86f6cb5]
module.keycloak_dev.module.onestopauth_basic.module.client_b-ce-id-prod-3730.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9dc0a0b4-ceb0-4656-b589-0c1aeee8bba9]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a5b7488-e47c-40cc-9270-3a7cb6c98740]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6be1ff59-fbb1-413c-8ba7-0dc82d0a8f09]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d93bee8-51bc-4628-9bd6-28c86223b758]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=532e882f-23e3-4b1f-b623-87da219e84a5]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3d52de61-504c-4dad-9040-9b18488d3a83]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=433c6050-f9af-4d52-9d8d-d4cc22370459]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=17c09713-1067-439c-8d76-eda0a92b4cbb]
module.keycloak_prod.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a71a96c9-512b-4ffe-998b-4118884e2afd]
module.keycloak_prod.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b949269f-1787-4a2f-bb1a-5893cc952ec8]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56dca1f4-ef7a-4541-a11b-a3c5e389465f]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=681b1846-797e-40b3-b7ad-8b5d67e07167]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f1a2ff9b-88e0-47a6-8691-740d855287b9]
module.keycloak_prod.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ea37fb6d-e057-4226-bd9f-fd228af3c6e0]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ee94938e-f2dd-464a-be0a-a773b375eef3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=db78554b-7fdb-4ed8-8c5e-b20bf2ab8c46]
module.keycloak_prod.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7c6ecb0f-771f-4f91-ace4-e475ba133f05]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=68bba535-cdd7-4bde-a6f8-86d3cc55c130]
module.keycloak_prod.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d4b22318-2d5f-4782-ae17-bba47c4bc900]
module.keycloak_prod.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=abf83848-1629-4982-9b2f-9ffa9a53e0d6]
module.keycloak_prod.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0fd0e77b-1332-4801-b7eb-6c5916ef44c9]
module.keycloak_prod.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=83818442-7962-4607-b6ee-df01dfec9aa9]
module.keycloak_prod.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f52f84f7-c810-4803-87ef-676b25e2cb68]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=215df007-f631-4bdd-b1e8-0cb1d73dfa9e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=aad1dca1-d021-4d82-9f4f-4684f0699ba8]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b5fb3bbb-d6a6-4465-a82d-efee377517b0]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=72dde44e-3848-4f19-a129-0f0b1ceddcc3]
module.keycloak_prod.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=66bef8fc-0f56-43f9-9d52-b84ef88c03be]
module.keycloak_prod.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=419b1ccf-7737-4f68-af34-1bbc80b1b16d]
module.keycloak_prod.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=55ab2f27-7991-46f5-b006-cf651ac64b05]
module.keycloak_prod.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7b5ce515-4c7f-4128-ae2d-36cc21f5656b]
module.keycloak_prod.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c808b5f7-16a3-46ef-aa19-2256a12af8c3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4dd851b2-6e99-47c9-ad5a-c104c50f2987]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3989dbda-821a-4bd9-9ce8-0fe9bfce0a46]
module.keycloak_prod.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=72f615b4-1a6a-42e0-861b-afb9a76bdefa]
module.keycloak_prod.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=01498a95-f543-4f08-8c56-b20b42418fd9]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8ea5870d-faaf-4dae-8635-dd009b498f01]
module.keycloak_prod.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c5389d3f-c670-4565-a6b7-e0a67781e9d0]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f5469356-f387-45fc-8400-19b035bfedda]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=21536bfa-a1b1-4d4d-9575-83e810737150]
module.keycloak_prod.module.onestopauth.module.client_jon-test-12-473.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7296cd65-0e8c-41ca-a4d4-f7948825fb67]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=044874c2-6431-48ae-8406-6f7b8458a0e3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=18510fcb-ee80-41fb-92c3-d157d51ae5bc]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1262b864-ed54-459b-b135-4cb8286d3554]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=88e90e9e-9922-4a2f-91e1-8448f5df613c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=33b536c5-c7e8-47e1-8ff6-1f09709b32ec]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8594b13a-9c12-4390-94f5-7ba0d0050a91]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=57b3f858-b7ef-4126-8e0d-bc5605c0504c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1505ede9-97cb-4b02-951e-57b9c006331b]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=75f152fc-ed9f-409d-bce8-0035c0d895c3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=966222d7-7d28-4ad1-9f67-d9dda46754e4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f4290d21-f42e-402d-83da-abc8d4041fdb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5fbabd38-1d26-44f9-8086-9b675782ebad]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbcd40f7-b57e-448b-9668-93bed4daf83f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bfe0a642-272e-4dc6-bceb-c74311c94cef]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8d52fb94-c091-4959-813e-8cddacafaa13]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ded15d3f-dee9-47bd-b03b-f88dbd574868]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=548dd2de-3aba-490e-844e-74d70b0d330d]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=40077f81-711d-4a09-904a-eae4bea03f44]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=55bb3928-b97f-4aae-9011-faf5a92d5d7e]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ba02ab6f-67d0-4f1f-a809-1f9a2ff2cc71]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=07ba0da1-dc37-450a-afb5-daef9551eb7e]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=93490bf6-ac82-469c-b52e-85e046457093]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a6ae35d9-5d61-4705-ad38-c5136866a1a3]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4de20fc-1333-4628-96f7-d919deb8eb01]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=96b9351e-8a31-49e0-b9c0-517639e7d236]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2871b1e0-719a-41b0-bc7c-a4db1923c469]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e14d93a8-5435-42c4-bc25-13804d761bc3]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6f1e226a-a94f-4481-86a5-3459a7628694]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dd931d26-0b85-485a-8aab-734754b5a63b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83d95a20-8363-4f99-8619-7b3991dba8d8]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1cbd40db-e353-40a4-a860-fad0423eb01a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=026e79a6-549b-4d4a-985f-ca82c23927a2]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "testprojectjunmin-3367"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "testprojectjunmin-3367"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-3367.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "testprojectjunmin-3367"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "testprojectjunmin-3367"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3001",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*